Absolutely — here’s **Part 4: Configuration Files & Saving Changes**, explained in **full detailed depth** with no summarizing or shortcutting. This part is all about understanding how Cisco devices handle config files and what happens if you forget to save. Let’s break it down the way Jeremy teaches it — but even deeper, like you’re walking through it yourself.

---

## 💾 Part 4: Configuration Files & Saving Changes in Cisco IOS

---

### 🔄 Why You Need to Understand Config Files

When you're working on Cisco devices, **nothing you do is permanent** until you save it.

> Just because something “works” now doesn’t mean it will still work after a reboot.

Cisco keeps **two different configuration files** — and it’s **vital** to understand how they work.

---

### 📁 The Two Config Files: Running vs. Startup

|Config File|Location|What it does|
|---|---|---|
|`running-config`|RAM (volatile)|The **active config** in memory — what’s running RIGHT NOW|
|`startup-config`|NVRAM (non-volatile)|The **saved config** that gets loaded on the next reboot|

---

### 🟢 `running-config` — What’s Live Now

- Every time you enter a command in the CLI (like setting a password or changing an interface), you're **changing the running-config**.
    
- Think of it like a **live scratchpad**.
    
- But it lives in **RAM**, so if the device **reloads or powers off**, it's **gone**.
    

```bash
Router# show running-config
```

This command shows the **current active config**.

---

### 🔴 `startup-config` — What Loads on Boot

- This is the config that’s stored permanently in NVRAM.
    
- It’s what the router/switch uses **when it first powers on**.
    

```bash
Router# show startup-config
```

If you haven’t saved your running-config, this might show:

```plaintext
startup-config is not present
```

Or you’ll see **an older version** of your config — not your recent changes.

---

### 🔄 The Problem: If You Reboot Before Saving

Let’s say:

- You set up an `enable password`
    
- It works
    
- You test it
    
- All good
    

But then — **you forget to save the config**, and the power goes out.

Next time the device boots up, it loads from `startup-config` — which has **none of your changes**.

🙈 Back to square one.

---

### 💾 How to Save the Config: 3 Equivalent Commands

To permanently save the `running-config` to `startup-config`, you have a few options.

All must be entered from **privileged EXEC mode** (`Router#`).

---

#### ✅ Option 1: `write`

```bash
Router# write
```

Output:

```plaintext
Building configuration...
[OK]
```

Quick and easy — saves everything that’s in RAM to NVRAM.

---

#### ✅ Option 2: `write memory`

```bash
Router# write memory
```

Same exact result, just the full version of the `write` command.

Output:

```plaintext
Building configuration...
[OK]
```

---

#### ✅ Option 3: `copy running-config startup-config`

```bash
Router# copy running-config startup-config
```

This is the **clearest** command — it literally describes what’s happening:

> Copy what’s in RAM to NVRAM. Save current state as the boot configuration.

You might get a prompt like:

```plaintext
Destination filename [startup-config]? 
```

Just press **Enter** to accept the default. You’ll see:

```plaintext
Building configuration...
[OK]
```

🧠 All three commands **do the same thing** — they write the current config to memory that persists through a reboot.

---

### 🛠️ Bonus: Viewing Configs from Different Modes

Normally, you run `show` commands from **privileged EXEC mode** (`Router#`). But what if you’re inside **global configuration mode** (`Router(config)#`)?

You can **still run EXEC-level commands** by putting `do` in front of them.

```bash
Router(config)# do show running-config
```

This is a **huge productivity tip** — no need to exit config mode just to check your config.

---

### 🧪 Test the Process in Lab

Let’s walk through a full hands-on test:

#### 1. Set a password

```bash
Router(config)# enable password CCNA
```

#### 2. Confirm it’s in running-config

```bash
Router# show running-config
```

You’ll see:

```plaintext
enable password CCNA
```

#### 3. Check startup-config

```bash
Router# show startup-config
```

If you haven’t saved, it may say:

```plaintext
startup-config is not present
```

Or:

```plaintext
enable password <not shown>
```

#### 4. Save the config

```bash
Router# copy running-config startup-config
```

Output:

```plaintext
Destination filename [startup-config]? 
Building configuration...
[OK]
```

#### 5. Verify the save

```bash
Router# show startup-config
```

Now you'll see the same `enable password CCNA` listed there.

---

### 🔁 One More Thing: What If You Modify After Saving?

Let’s say you saved the config, and then you:

```bash
Router(config)# no enable password
```

If you reboot now **without saving again**, your device will **load the last saved config** — and the password will still be there.

So always remember:

```bash
copy running-config startup-config
```

🧠 **Save early. Save often.**

---

Let me know when you're ready for **Part 5: Removing Configs and Full Command Review**, or if you'd like this formatted in Markdown for Obsidian!