Perfect. Youâ€™re continuing your work on the **Network Build Project**, and now you've been promoted to work directly with a **Layer 2 switch** using the **CLI terminal only** â€” no GUI clicks. You'll still use the project from Assignment 1.1, just extend it.

---

## ðŸ§¾ **Assignment 2 â€“ Ethernet Switch Basics (CLI Focus)**

### ðŸŽ¯ **Objective**:

Extend your 2-PC setup by introducing a **Cisco switch**, connect all PCs through it, and practice:

- MAC address learning
    
- CLI configuration
    
- MAC address table inspection
    

---

### âœ… **Tools Needed**:

- Cisco Packet Tracer
    
- Devices already in project: **PC0**, **PC1**
    
- Add: **1 Cisco 2960 Switch**, **1 PC (PC2)**
    

---

## ðŸ“¦ **Task Instructions**

---

### ðŸ”§ Step 1: Modify the Topology

1. **Delete the direct crossover cable** between PC0 and PC1.
    
2. **Add a switch (2960)** to your workspace.
    
3. Use **straight-through cables** to connect:
    
    - PC0 â†’ Switch port **FastEthernet 0/1**
        
    - PC1 â†’ Switch port **FastEthernet 0/2**
        
    - PC2 â†’ Switch port **FastEthernet 0/3**
        
4. Add PC2:
    
    - IP: `192.168.1.3`
        
    - Subnet Mask: `255.255.255.0`
        

---

### ðŸ–¥ï¸ Step 2: Access the CLI of the Switch

1. Click the switch â†’ Go to **CLI** tab.
    
2. Begin configuration.
    

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname SW1
SW1(config)# no ip domain-lookup
```

âœ… This sets hostname and disables annoying DNS lookup delay if you mistype.

---

### ðŸ”Ž Step 3: Test Connectivity

From **PC0**, run:

```bash
ping 192.168.1.2
ping 192.168.1.3
```

From **PC2**, run:

```bash
ping 192.168.1.1
```

---

### ðŸ“œ Step 4: View MAC Address Learning on Switch

Back to switch CLI:

```bash
SW1# show mac address-table
```

âœ… This shows:

- **Dynamically learned MACs**
    
- **Associated interfaces**
    
- How the switch builds its **MAC address table**
    

You can also run:

```bash
SW1# show mac address-table dynamic
```

---

### ðŸ’£ Bonus Cleanup Commands (Observe Aging or Clear Table)

Clear the MAC address table manually:

```bash
SW1# clear mac address-table dynamic
```

Then run `show mac address-table` again.

---

## ðŸ“˜ **What You Will Learn**

- A **switch learns MAC addresses** by examining source MACs of incoming frames.
    
- It **forwards known unicasts** to the right port and **floods unknowns**.
    
- You can use CLI commands just like in real Cisco switches to monitor and clear entries.
    
- CLI-first approach helps **prepare for CCNA exams** and real-world networks.
    

---

Let me know once you're done, and I'll assign **Assignment 3: ARP & Broadcast Behavior** (still building on this project).